In [1]:
import pandas as pd

In [43]:
## create dataframe
data= {
    "city": ["Delhi","Mumbai","Bengluru","Mumbai","Dehi","Kolkata"],
    "Year": [2018,2019,2021,2022,2023,2024],
    "pop_milli": [18.6,20.4,12.3,20.7,19.1,14.2]
    } 

df=pd.DataFrame(data)
df

       city  Year  pop_milli
0     Delhi  2018       18.6
1    Mumbai  2019       20.4
2  Bengluru  2021       12.3
3    Mumbai  2022       20.7
4      Dehi  2023       19.1
5   Kolkata  2024       14.2

In [7]:
df.head(1)

   city  Year  pop_milli
0  Dehi  2018       18.6

In [9]:
df.tail(2)

      city  Year  pop_milli
4     Dehi  2023       19.1
5  Kolkata  2024       14.2

In [10]:
df2=pd.DataFrame(data, columns=["Year","pop_milli","city"])
df2

   Year  pop_milli      city
0  2018       18.6      Dehi
1  2019       20.4    Mumbai
2  2021       12.3  Bengluru
3  2022       20.7    Mumbai
4  2023       19.1      Dehi
5  2024       14.2   Kolkata

In [11]:
df2=pd.DataFrame(data,columns=["Year","pop_milli","city","growth_rate"])
df2

   Year  pop_milli      city growth_rate
0  2018       18.6      Dehi         NaN
1  2019       20.4    Mumbai         NaN
2  2021       12.3  Bengluru         NaN
3  2022       20.7    Mumbai         NaN
4  2023       19.1      Dehi         NaN
5  2024       14.2   Kolkata         NaN

In [12]:
df2.columns

Index(['Year', 'pop_milli', 'city', 'growth_rate'], dtype='object')

In [13]:
## retrieve columns
df["city"]

0        Dehi
1      Mumbai
2    Bengluru
3      Mumbai
4        Dehi
5     Kolkata
Name: city, dtype: object

In [14]:
df.Year

0    2018
1    2019
2    2021
3    2022
4    2023
5    2024
Name: Year, dtype: int64

In [15]:
## access rows 
df.loc[1]

city         Mumbai
Year           2019
pop_milli      20.4
Name: 1, dtype: object

In [16]:
df.iloc[1]

city         Mumbai
Year           2019
pop_milli      20.4
Name: 1, dtype: object

In [17]:
df.iloc[0:3]

       city  Year  pop_milli
0      Dehi  2018       18.6
1    Mumbai  2019       20.4
2  Bengluru  2021       12.3

In [19]:
df.iloc[[1,3,5]]

      city  Year  pop_milli
1   Mumbai  2019       20.4
3   Mumbai  2022       20.7
5  Kolkata  2024       14.2

In [35]:
df["growth_rate"] = 1.5
print(df)

       city  Year  pop_milli  growth_rate
0      Dehi  2018       18.6          1.5
1    Mumbai  2019       20.4          1.5
2  Bengluru  2021       12.3          1.5
3    Mumbai  2022       20.7          1.5
4      Dehi  2023       19.1          1.5
5   Kolkata  2024       14.2          1.5

In [36]:
import numpy as np
df["growth_rate"]=np.arange(6)
df

       city  Year  pop_milli  growth_rate
0      Dehi  2018       18.6            0
1    Mumbai  2019       20.4            1
2  Bengluru  2021       12.3            2
3    Mumbai  2022       20.7            3
4      Dehi  2023       19.1            4
5   Kolkata  2024       14.2            5

In [50]:
s=pd.Series([0.5,0.8,0.9],index=[0,2,5])
s
## assign ane col "score_by_label"
df["score_by_Label"]=s
df

       city  Year  pop_milli  score_by_Label
0     Delhi  2018       18.6             0.5
1    Mumbai  2019       20.4             NaN
2  Bengluru  2021       12.3             0.8
3    Mumbai  2022       20.7             NaN
4      Dehi  2023       19.1             NaN
5   Kolkata  2024       14.2             0.9

In [51]:
## filtering data with bolean indexing
df["is_delhi"]=df["city"] == "Delhi"
df

       city  Year  pop_milli  score_by_Label  is_delhi
0     Delhi  2018       18.6             0.5      True
1    Mumbai  2019       20.4             NaN     False
2  Bengluru  2021       12.3             0.8     False
3    Mumbai  2022       20.7             NaN     False
4      Dehi  2023       19.1             NaN     False
5   Kolkata  2024       14.2             0.9     False

In [52]:
df_delhi=df[df["is_delhi"]]
df_delhi

    city  Year  pop_milli  score_by_Label  is_delhi
0  Delhi  2018       18.6             0.5      True

In [53]:
mask=(df["city"]=="Mumbai") & (df["Year"] >= 2020)
mask

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [54]:
del df["is_delhi"]
df.columns

Index(['city', 'Year', 'pop_milli', 'score_by_Label'], dtype='object')

In [55]:
df3=df.drop(columns=["score_by_Label"])
df3

       city  Year  pop_milli
0     Delhi  2018       18.6
1    Mumbai  2019       20.4
2  Bengluru  2021       12.3
3    Mumbai  2022       20.7
4      Dehi  2023       19.1
5   Kolkata  2024       14.2

In [56]:
df

       city  Year  pop_milli  score_by_Label
0     Delhi  2018       18.6             0.5
1    Mumbai  2019       20.4             NaN
2  Bengluru  2021       12.3             0.8
3    Mumbai  2022       20.7             NaN
4      Dehi  2023       19.1             NaN
5   Kolkata  2024       14.2             0.9

In [57]:
## datarame creation dfrom nested dictionary
populations= {
    "shimla" : {2000:1.5,2001:1.7,2002:3.6},
    "Hamirpur": {2001:2.4,2002:2.9}
}
frame1=pd.DataFrame(populations)
frame1

      shimla  Hamirpur
2000     1.5       NaN
2001     1.7       2.4
2002     3.6       2.9

In [73]:
frame1.T

          2000  2001  2002
shimla     1.5   1.7   3.6
Hamirpur   NaN   2.4   2.9

In [84]:
## 2D array
import numpy as np
import pandas as pd
arr=np.array([[1,2,3,4],[4,5,6,7]])
obj=pd.DataFrame(arr,columns=["A","B","C","D"],index=["rajesh","muskan"])
obj

        A  B  C  D
rajesh  1  2  3  4
muskan  4  5  6  7

In [79]:
obj2=pd.DataFrame({
    "city":["Delhi","Mumbai"],
    "Year":[2025,2026]
})
obj2

     city  Year
0   Delhi  2025
1  Mumbai  2026

In [80]:
ind=pd.Index([1,2,3])

In [81]:
ind

Index([1, 2, 3], dtype='int64')

In [85]:
frame1

      shimla  Hamirpur
2000     1.5       NaN
2001     1.7       2.4
2002     3.6       2.9

In [86]:
frame1.columns.name="state"
frame1

state  shimla  Hamirpur
2000      1.5       NaN
2001      1.7       2.4
2002      3.6       2.9

In [87]:
frame1.index.name="year"
frame1

state  shimla  Hamirpur
year
2000      1.5       NaN
2001      1.7       2.4
2002      3.6       2.9

In [88]:
a=frame1.to_numpy()
a

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])